Documents/Renault_ПеремещениеАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ПеремещениеАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.Renault_НачисленияВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_МаршрутыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыЗаявкиНаПеремещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашАвтомобиль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НашВодитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйРейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Место</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаПеремещение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Renault_ЗаявкаНаПеремещение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СобственныеАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СобственныеАвтомобили</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_СтатусыЗаявкиНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыЗаявкиНаПеремещение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ПеремещениеАвтомобилей/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ЗаявкиСписок;

//////////////////////////////////////////
//События формы
//------------------BEGIN-----------------
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Номер.ТолькоПросмотр = НЕ РольДоступна("ПолныеПрава");
	
	Если Объект.Ссылка.Пустая() Тогда
		ЭтоМосква = Константы.Renault_ЭтоМосковскаяБаза.Получить();
		Renault_ОбщегоНазначенияКлиентСервер.ЗаполнитьНовыйДокумент(Объект, ПараметрыСеанса.Пользователь);
		Объект.НашАвтомобиль = ЭтоМосква <> Истина;
		Объект.НашВодитель = ЭтоМосква <> Истина;
		Объект.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.ВПути;
	Иначе
		Если Объект.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
			Элементы.Статус.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Маршрут") Тогда
		Параметры.Свойство("Маршрут", Объект.Маршрут);
	КонецЕсли;
	
	Если Параметры.Свойство("АвтомобильИЗаявка") Тогда
		НоваяСтрока = Объект.Автомобили.Добавить();
		НоваяСтрока.Автомобиль = Параметры.АвтомобильИЗаявка.Автомобиль1;
		НоваяСтрока.ЗаявкаНаПеремещение = Параметры.АвтомобильИЗаявка.Заявка1;
		НоваяСтрока.Место = Число(Параметры.АвтомобильИЗаявка.Место1);
	КонецЕсли;
	
	Если Параметры.Свойство("АвтомобильИЗаявка1") Тогда
		НоваяСтрока = Объект.Автомобили.Добавить();
		НоваяСтрока.Автомобиль = Параметры.АвтомобильИЗаявка1.Автомобиль2;
		НоваяСтрока.ЗаявкаНаПеремещение = Параметры.АвтомобильИЗаявка1.Заявка2;
		НоваяСтрока.Место = Число(Параметры.АвтомобильИЗаявка1.Место2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Проведен Тогда
		УстановитьДоступновстьВсехРеквизитов();
	КонецЕсли;
	
	ЗафиксироватьОперацию = ЗначениеЗаполнено(Объект.ДатаОперации);
	ОбновитьВидимостьЭлементов();
	УстановитьДоступностьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
		Сообщить("Перемещение закрыто. Перепроведение со статусом ""Закрыто"" невозможно!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.Маршрут.СкладОтправитель.Renault_Территория <> Объект.Маршрут.СкладПолучатель.Renault_Территория Тогда
		
		Если Объект.НашАвтомобиль И Объект.НашВодитель Тогда
			Если Объект.Водитель.Пустая() Тогда
				Сообщить("Не выбран водитель!", СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
			Если Объект.Автомобиль.Пустая() Тогда
				Сообщить("Не выбран эвакуатор!", СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Строка из Объект.Автомобили Цикл
			Если Не ЗначениеЗаполнено(Строка.ЗаявкаНаПеремещение) Тогда
				Заявки = ПолучитьЗаявкуНаПеремещение(Строка.Автомобиль);
				Если Заявки.Свойство("Заявка") ИЛИ Заявки.Свойство("Заявки") Тогда
				Сообщить("В строке " + Строка.НомерСтроки + " не указан документ ""Заявка на перемещение""");
				Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Объект.Водитель = 0;
		Объект.Автомобиль = 0;
		
	КонецЕсли;
	
	Объект.ДатаОперации = ?(ЗафиксироватьОперацию, Объект.ДатаОперации, Неопределено);
	
КонецПроцедуры

//------------------END-------------------
//События формы
//////////////////////////////////////////

//////////////////////////////////////////
//События элементов
//------------------BEGIN-----------------

&НаКлиенте
Процедура ЗафиксироватьОперациюПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементов();
	Объект.ДатаОперации = ?(ЗафиксироватьОперацию, ТекущаяДата(), Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьАвто(Команда)
	
	ЗаполнитьСтрокуНовымАвто(ДиалогВыбораАвто());
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАвто(Команда)
	
	текДанные = Элементы.Автомобили.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		ЗаполнитьСтрокуНовымАвто(ДиалогВыбораАвто(), текДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьАвто(Команда)
	
	текДанные = Элементы.Автомобили.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		Объект.Автомобили.Удалить(текДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобилиАвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	текДанные = Элементы.Автомобили.ТекущиеДанные;
	ЗаявкиСписок = Неопределено;
	Если текДанные <> Неопределено Тогда
		ЗаполнитьСтрокуНовымАвто(ДиалогВыбораАвто(), текДанные);
	КонецЕсли;
	
КонецПроцедуры
//------------------END-------------------
//События элементов
//////////////////////////////////////////

//////////////////////////////////////////
//самописные процедуры и функции
//------------------BEGIN-----------------

&НаКлиенте
Процедура ЗаполнитьСтрокуНовымАвто(ВыбАвто, текСтрока = Неопределено)
	
	Если ВыбАвто <> Неопределено Тогда
		
		текМесто = ПолучитьПарковочноеМесто(ВыбАвто);
		Заявка = Неопределено;
		
		ЗаявкаНаПеремещение = ПолучитьЗаявкуНаПеремещение(ВыбАвто); //возвращает структуру сообщение, заявка или список заявок
		Если ЗаявкаНаПеремещение.Свойство("Сообщение") Тогда
			Сообщить(ЗаявкаНаПеремещение["Сообщение"]);
			Если ЗаявкаНаПеремещение.Свойство("Заявки") Тогда
				ЗаявкиСписок = ЗаявкаНаПеремещение["Заявки"]; 
			КонецЕсли;
		Иначе
			Заявка = ЗаявкаНаПеремещение["Заявка"];
			ЗаявкиСписок = Новый СписокЗначений;
			ЗаявкиСписок.Добавить(ЗаявкаНаПеремещение["Заявка"]); 
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(?(текСтрока = Неопределено, Объект.Автомобили.Добавить(), текСтрока),
									Новый Структура("Автомобиль, Место, ЗаявкаНаПеремещение", ВыбАвто, текМесто, Заявка));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаявкуНаПеремещение(ВыбАвто)
	
	ЗаявкаНаПеремещениеСтруктура = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_ЗаявкаНаПеремещение.Ссылка
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	Документ.Renault_ЗаявкаНаПеремещение КАК Renault_ЗаявкаНаПеремещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланПеремещений КАК ПланПеремещений
	|		ПО ПланПеремещений.ЗаявкаНаПеремещение = Renault_ЗаявкаНаПеремещение.Ссылка
	|ГДЕ
	|	Renault_ЗаявкаНаПеремещение.Маршрут = &Маршрут
	|	И Renault_ЗаявкаНаПеремещение.Автомобиль = &Автомобиль
	|	И НЕ ПланПеремещений.ЗаявкаНаПеремещение.Ссылка ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заявки.Ссылка КАК Заявка,
	|	Renault_ПеремещениеАвтомобилейАвтомобили.Ссылка КАК Ссылка1
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Renault_ПеремещениеАвтомобилей.Автомобили КАК Renault_ПеремещениеАвтомобилейАвтомобили
	|		ПО ВТ_Заявки.Ссылка = Renault_ПеремещениеАвтомобилейАвтомобили.ЗаявкаНаПеремещение
	|ГДЕ
	|	Renault_ПеремещениеАвтомобилейАвтомобили.Ссылка ЕСТЬ NULL ";
	Запрос.УстановитьПараметр("Маршрут", Объект.Маршрут);
	Запрос.УстановитьПараметр("Автомобиль", ВыбАвто); 
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ЗаявкаНаПеремещениеСтруктура.Вставить("Сообщение", "Для выбранного автомобиля нет заявок на перемещение");		 
	Иначе
		Выборка = Результат.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			МассивЗаявок = Новый Массив;
			Пока Выборка.Следующий() Цикл
				МассивЗаявок.Добавить(Выборка.Заявка);
			КонецЦикла;
			ЗаявкаНаПеремещениеСтруктура.Вставить("Сообщение", "Для выбранного автомобиля создано несколько заявок на перемещение! Необходимо указать заявку");
			ЗаявкаНаПеремещениеСтруктура.Вставить("Заявки", МассивЗаявок);
		ИначеЕсли Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			ЗаявкаНаПеремещениеСтруктура.Вставить("Заявка", Выборка.Заявка); 
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗаявкаНаПеремещениеСтруктура;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.ДатаОперации.Видимость = ЗафиксироватьОперацию;
	УстановитьВидимостьМест();
	Элементы.ПечатьАктаПриемаПередачи.Видимость = Объект.Маршрут.СкладПолучатель.Renault_СкладХраненияАМ;
	
КонецПроцедуры

&НаКлиенте
Функция ДиалогВыбораАвто()
	
	Если НЕ Объект.Маршрут.Пустая() Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ОбработкаВыбора", 		Истина);
		ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов",	ИспользованиеГруппИЭлементов.Элементы);
		ПараметрыОткрытия.Вставить("МножественныйВыбор",	НЕ ЗакрыватьПриВыборе);
		ПараметрыОткрытия.Вставить("РазрешитьВыборКорня",	Ложь);
		ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе",	ЗакрыватьПриВыборе);
		
		ПараметрыОтбора = Новый Структура;
		
		МассивАвто = Новый Массив;
		Для каждого текАвто ИЗ Объект.Автомобили Цикл
			Если МассивАвто.Найти(текАвто.Автомобиль) = Неопределено Тогда
				МассивАвто.Добавить(текАвто.Автомобиль);
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОтбора.Вставить("Склад", Объект.Маршрут.СкладОтправитель);
		//ПараметрыОтбора.Вставить("Период", Объект.Дата);
		ПараметрыОтбора.Вставить("Период", Объект.ДатаОперации);
		ПараметрыОтбора.Вставить("МассивАвто", МассивАвто);
		Возврат ОткрытьФормуМодально("Справочник.Автомобили.Форма.ФормаВыбораАвтосалон", ПараметрыОтбора, Элементы.Автомобили);
		
	Иначе
		
		Предупреждение("Необходимо указать маршрут!", 8);
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КомандаЗаполнитьПоПлану(Команда)
	
	Если Объект.Автомобили.Количество() Тогда
		
		вТекстВопроса      = "При заполнении текущий список автомобилей будет очищен." + Символы.ПС + "Продолжить?";
		вКнопки            = РежимДиалогаВопрос.ДаНет;
		вТаймаут           = 15;
		вКнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
		вЗаголовок         = "Заполнение...";
		вКнопкаТаймаута    = КодВозвратаДиалога.Нет;
		
		Если Вопрос(вТекстВопроса, вКнопки, вТаймаут, вКнопкаПоУмолчанию, вЗаголовок, вКнопкаТаймаута) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		Иначе
			Объект.Автомобили.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	СписокПеремещений = ПолучитьСписокПеремещений();
	
	Результат = ВыбратьИзМеню(СписокПеремещений, Элементы.АвтомобилиКоманднаяПанель);
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьПоПлану(Результат.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция  ПолучитьСписокПеремещений()
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(1) КАК Количество,
	|	НАЧАЛОПЕРИОДА(ПланПеремещений.ДатаПлан, ДЕНЬ) КАК ДеньПлан,
	|	Маршруты.Ссылка КАК Маршрут
	|ИЗ
	|	РегистрСведений.ПланПеремещений КАК ПланПеремещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_МаршрутыПеремещений КАК Маршруты
	|		ПО ПланПеремещений.СкладОтправитель = Маршруты.СкладОтправитель
	|			И ПланПеремещений.СкладПолучатель = Маршруты.СкладПолучатель
	|ГДЕ
	|	ПланПеремещений.ДатаПлан <= &ДатаКон
	|	И НЕ ПланПеремещений.Перемещено
	|	И ВЫБОР
	|			КОГДА &СкладОтправитель = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПланПеремещений.СкладОтправитель = &СкладОтправитель
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &СкладПолучатель = ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПланПеремещений.СкладПолучатель = &СкладПолучатель
	|		КОНЕЦ
	|	И НЕ ПланПеремещений.СозданДокументПеремещения
	|	И НЕ ПланПеремещений.ЗаписьЗаблокирована
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПланПеремещений.ДатаПлан, ДЕНЬ),
	|	Маршруты.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДеньПлан,
	|	Количество УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата() + 604800));
	
	Если ЗначениеЗаполнено(Объект.Маршрут) Тогда
		Запрос.УстановитьПараметр("СкладОтправитель", Объект.Маршрут.СкладОтправитель);
		Запрос.УстановитьПараметр("СкладПолучатель", Объект.Маршрут.СкладПолучатель);
	Иначе 
		Запрос.УстановитьПараметр("СкладОтправитель", Справочники.Склады.ПустаяСсылка());
		Запрос.УстановитьПараметр("СкладПолучатель", Справочники.Склады.ПустаяСсылка());
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Новый Структура("Дата, Маршрут", Выборка.ДеньПлан, Выборка.Маршрут), Формат(Выборка.ДеньПлан, "ДФ='дд.ММ.гггг ""г.""'") + " " + Выборка.Маршрут + " (" + Выборка.Количество + ")");
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗаполнитьПоПлану(ПараметрыЗапроса)
	
	Если Объект.Маршрут.Пустая() Тогда
		Объект.Маршрут = ПараметрыЗапроса.Маршрут;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланПеремещений.Автомобиль,
	|	ПланПеремещений.ДатаПлан КАК ДатаПлан,
	|	ЕСТЬNULL(Renault_МестаАвтомобилей.ПарковочноеМесто, 0) КАК ПарковочноеМесто,
	|	ПланПеремещений.ЗаявкаНаПеремещение
	|ИЗ
	|	РегистрСведений.ПланПеремещений КАК ПланПеремещений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_МестаАвтомобилей КАК Renault_МестаАвтомобилей
	|		ПО ПланПеремещений.Автомобиль = Renault_МестаАвтомобилей.Автомобиль
	|ГДЕ
	|	ПланПеремещений.ДатаПлан МЕЖДУ &ДатаНач И &ДатаКон
	|	И ПланПеремещений.СкладОтправитель = &СкладОтправитель
	|	И ПланПеремещений.СкладПолучатель = &СкладПолучатель
	|	И НЕ ПланПеремещений.СозданДокументПеремещения
	|	И НЕ ПланПеремещений.ЗаписьЗаблокирована
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПлан";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПараметрыЗапроса.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПараметрыЗапроса.Дата));
	Запрос.УстановитьПараметр("СкладОтправитель", ПараметрыЗапроса.Маршрут.СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", ПараметрыЗапроса.Маршрут.СкладПолучатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сч = 0;
	
	Пока Выборка.Следующий() И Сч < 2 Цикл
		НоваяСтрока = Объект.Автомобили.Добавить();
		НоваяСтрока.Автомобиль = Выборка.Автомобиль;
		НоваяСтрока.Место = Выборка.ПарковочноеМесто;
		НоваяСтрока.ЗаявкаНаПеремещение = Выборка.ЗаявкаНаПеремещение;
		Сч = Сч + 1;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура АвтомобилиМестоНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Маршрут) Тогда
		Возврат;
	КонецЕсли;
	
	СвободныеМеста = ПолучитьСвободныеМеста();
	Элемент.СписокВыбора.ЗагрузитьЗначения(СвободныеМеста.ВыгрузитьКолонку("ПарковочноеМесто"));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСвободныеМеста()
	
	ТаблицаМестВДокументе = Новый ТаблицаЗначений;
	ТаблицаМестВДокументе.Колонки.Добавить("Место", Новый ОписаниеТипов("Число"));
	
	Для Каждого Строка Из Объект.Автомобили Цикл
		Если Строка.Место Тогда
			НоваяСтрока = ТаблицаМестВДокументе.Добавить();
			НоваяСтрока.Место = Строка.Место;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МестаВДокументе.Место
	|ПОМЕСТИТЬ ВТМестаВДокументе
	|ИЗ
	|	&МестаВДокументе КАК МестаВДокументе
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Renault_МестаАвтомобилей.ПарковочноеМесто
	|ИЗ
	|	РегистрСведений.Renault_МестаАвтомобилей КАК Renault_МестаАвтомобилей
	|ГДЕ
	|	Renault_МестаАвтомобилей.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|	И Renault_МестаАвтомобилей.Территория = &Территория
	|	И НЕ Renault_МестаАвтомобилей.ПарковочноеМесто В
	|				(ВЫБРАТЬ
	|					ВТМестаВДокументе.Место
	|				ИЗ
	|					ВТМестаВДокументе КАК ВТМестаВДокументе)";
	
	Запрос.УстановитьПараметр("Территория", Объект.Маршрут.СкладПолучатель.Renault_Территория);
	Запрос.УстановитьПараметр("МестаВДокументе", ТаблицаМестВДокументе);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Объект.Ссылка.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Тогда
		Объект.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто;
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьМест();
	
	Для Каждого Строка Из Объект.Автомобили Цикл
		Строка.Место = 0;
	КонецЦикла;
	
КонецПроцедуры

 &НаКлиенте
Процедура УстановитьВидимостьМест()
	
	//Если Объект.Статус = Перечисления.Renault_СтатусыЗаявкиНаПеремещение.Закрыто Или Объект.Маршрут.СкладОтправитель.ШоуРум Или Объект.Маршрут.СкладОтправитель.СкладРеализацииАвтомобилей Тогда
	//	Элементы.АвтомобилиМесто.Видимость = Истина;
	//Иначе
	//	Элементы.АвтомобилиМесто.Видимость = Ложь;
	//КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьТТН(Команда)
	
	Если Не Объект.Проведен Тогда
		Сообщить("Для печати ТТН необходимо провести документ!");
		Возврат;
	КонецЕсли;
	
	ТабДок = ПечататьТТН();
	//УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 2, Ложь, "Товарно-транспортная накладная № " + Объект.Номер + " от " + Объект.Дата, Ложь);
	ТабДок.Показать("Товарно-транспортная накладная № " + Объект.Номер + " от " + Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьПикингЛиста(Команда)
	
	Если Не Объект.Проведен Тогда
		Сообщить("Для печати пикинг-листа необходимо провести документ!");
		Возврат;
	КонецЕсли;
	
	ТабДок = ПечататьПикингЛист();
	//УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 2, Ложь, "Пикинг-лист № " + Объект.Номер + " от " + Объект.Дата, Ложь);	
	ТабДок.Показать("Пикинг-лист № " + Объект.Номер + " от " + Объект.Дата,,Истина);
	
КонецПроцедуры

&НаСервере
Функция ПечататьПикингЛист()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ТекОбъект.ПолучитьМакет("ПикингЛист");
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	ОбластьШапка.Параметры.ДатаПечати = Объект.Дата;
	ОбластьШапка.Параметры.НомерДокумента = Объект.Номер;
	ОбластьШапка.Параметры.Затребовал = Объект.Маршрут.СкладПолучатель;
	
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Для Каждого Строка Из Объект.Автомобили Цикл
		
		ТекАвто = Строка.Автомобиль;
		ОбластьСтрока.Параметры.Автомобиль = "" + ТекАвто.Модель.Родитель + " - " + ТекАвто.Модель + " - VIN " + ТекАвто.Код;
		ОбластьСтрока.Параметры.Маршрут = "" + Объект.Маршрут.СкладОтправитель.Renault_Территория + " - " + Объект.Маршрут.СкладПолучатель.Renault_Территория;
		ОбластьСтрока.Параметры.ВнутреннийНомер = Строка.Место;
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПечататьТТН()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ТекОбъект.ПолучитьМакет("ТТН");
	НомерПП = 1;
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	Запчасти  = Макет.ПолучитьОбласть("Запчасти");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	Организация = ТекОбъект.Организация;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонРабочий)
	|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))";
	
	Запрос.УстановитьПараметр("Объект", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	АдресОрганизации = "";
	ТелефонОрганизации = "";
	Пока Выборка.Следующий() цикл
		Если Выборка.Тип = перечисления.ТипыКонтактнойИнформации.Телефон тогда
			ТелефонОрганизации = Выборка.Представление;
		Иначе
			АдресОрганизации = Выборка.Представление;
		КонецЕсли;
	КонецЦикла;
	
	ОбластьШапка.Параметры.НомерПеремещения = Объект.Номер;
	//Краткое наименование организации, Основной адрес, Телефон, ИНН, КПП, ОГРН,  Расчетный счет, Наименование банка, Кор.счет банка , БИК банка, ОКВЭД организации, ОКПО.	
	ГосНомер = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(
	|			,
	|			Автомобиль = &Автомобиль
	|				И ВидЗначения = &ВидЗначения) КАК АвтомобилиСрезПоследних";
	Запрос.УстановитьПараметр("Автомобиль", ТекОбъект.Автомобиль);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ГосНомер = Выборка.Значение;
	КонецЕсли;
	ОбластьШапка.Параметры.Эвакуатор = ?(ЗначениеЗаполнено(ТекОбъект.Автомобиль), "" + ТекОбъект.Автомобиль.Модель + "" + ГосНомер, ""); 
	
	Банк                             = ?(ЗначениеЗаполнено(Организация.ОсновнойБанковскийСчет), Организация.ОсновнойБанковскийСчет.Банк, Справочники.Банки.ПустаяСсылка());
	БанкПолучателя                   = ?(Банк <>Справочники.Банки.ПустаяСсылка(), Банк.Наименование, "");
	РасчСчет                         = ?(ЗначениеЗаполнено(Организация.ОсновнойБанковскийСчет), "р/с" + Организация.ОсновнойБанковскийСчет.НомерСчета, Справочники.БанковскиеСчета.ПустаяСсылка());
	КоррСчет                         = ?(Банк <>Справочники.Банки.ПустаяСсылка(), Банк.КоррСчет, "");
	БИК                              = ?(Организация.ОсновнойБанковскийСчет <> Справочники.БанковскиеСчета.ПустаяСсылка(), Организация.ОсновнойБанковскийСчет.Банк.Код, "");
	
	Если Объект.Маршрут.СкладПолучатель.Renault_СкладХраненияАМ Тогда
		
		ОрганизацияПолучателя = Объект.Маршрут.СкладПолучатель.Организация;
		
		Запрос	= Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Тип,
		|	КонтактнаяИнформация.Вид,
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Телефон)
		|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.ТелефонКонтактный)
		|			ИЛИ КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(перечисление.ТипыКонтактнойИнформации.Адрес)
		|				И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(справочник.ВидыКонтактнойИнформации.АдресЮридический))";
		
		Запрос.УстановитьПараметр("Объект", ОрганизацияПолучателя);
		Выборка = Запрос.Выполнить().Выбрать();
		АдресОрганизацииПолучателя = "";
		ТелефонОрганизацииПолучателя = "";
		Пока Выборка.Следующий() цикл
			Если Выборка.Тип = перечисления.ТипыКонтактнойИнформации.Телефон тогда
				ТелефонОрганизацииПолучателя = Выборка.Представление;
			Иначе
				АдресОрганизацииПолучателя = Выборка.Представление;
			КонецЕсли;
		КонецЦикла;
		
		БанкОрганизацииПолучателя            = ?(ЗначениеЗаполнено(ОрганизацияПолучателя.ОсновнойБанковскийСчет), ОрганизацияПолучателя.ОсновнойБанковскийСчет.Банк, Справочники.Банки.ПустаяСсылка());
		БанкПолучателяОрганизацииПолучателя  = ?(Банк <> Справочники.Банки.ПустаяСсылка(), Банк.Наименование, "");
		РасчСчетОрганизацииПолучателя        = ?(ЗначениеЗаполнено(ОрганизацияПолучателя.ОсновнойБанковскийСчет), ОрганизацияПолучателя.ОсновнойБанковскийСчет.НомерСчета, Справочники.БанковскиеСчета.ПустаяСсылка());
		КоррСчетОрганизацииПолучателя        = ?(Банк <> Справочники.Банки.ПустаяСсылка(), Банк.КоррСчет, "");
		БИКОрганизацииПолучателя             = ?(ОрганизацияПолучателя.ОсновнойБанковскийСчет <> Справочники.БанковскиеСчета.ПустаяСсылка(), ОрганизацияПолучателя.ОсновнойБанковскийСчет.Банк.Код, "");
		
		
		Если ЗначениеЗаполнено(ОрганизацияПолучателя) Тогда 
			ОбластьШапка.Параметры.ИнфаПолучатель   = ?(ЗначениеЗаполнено(ОрганизацияПолучателя.НаименованиеПолное), ОрганизацияПолучателя.НаименованиеПолное + " ", " ")
													+ АдресОрганизацииПолучателя + ", "
													+ ТелефонОрганизацииПолучателя + ", "
													+ ?(ЗначениеЗаполнено(ОрганизацияПолучателя.ИНН), "ИНН " + ОрганизацияПолучателя.ИНН + " ", "")
													+ ?(ЗначениеЗаполнено(ОрганизацияПолучателя.КПП), ",КПП " + ОрганизацияПолучателя.КПП + " ", "")
													+ ?(ЗначениеЗаполнено(ОрганизацияПолучателя.ОГРН), ",ОГРН " + ОрганизацияПолучателя.ОГРН + " ", "")
													+ ""+?(РасчСчетОрганизацииПолучателя <> ""," р\с " + РасчСчетОрганизацииПолучателя,"")
													+ ""+?(БанкПолучателяОрганизацииПолучателя <> ""," "+БанкПолучателяОрганизацииПолучателя,"")
													+ ""+?(КоррСчетОрганизацииПолучателя <> ""," к\с "+КоррСчетОрганизацииПолучателя,"")
													+ ""+?(БИКОрганизацииПолучателя <> ""," БИК "+БИКОрганизацииПолучателя,"")
													+ ""+?(ЗначениеЗаполнено(ОрганизацияПолучателя.КодПООКПО), " Код ОКПО " + ОрганизацияПолучателя.КодПООКПО + " ", "");
		Иначе
			Сообщить("В складе-получателе не указана Организация");
		КонецЕсли;
		
	Иначе
		ОбластьШапка.Параметры.ИнфаПолучатель        = ?(ЗначениеЗаполнено(Организация.Наименование), Организация.Наименование + " ", " ")
													 + АдресОрганизации
													 + ТелефонОрганизации
													 +  ?(ЗначениеЗаполнено(Организация.ИНН), "ИНН " + Организация.ИНН + " ", "")
													 + ?(ЗначениеЗаполнено(Организация.КПП), ",КПП " + Организация.КПП + " ", "")
													 + ?(ЗначениеЗаполнено(Организация.ОГРН), ",ОГРН " + Организация.ОГРН + " ", "")
													 + ""+?(РасчСчет <> ""," р\с "+РасчСчет,"")
													 + ""+?(БанкПолучателя <> ""," "+БанкПолучателя,"")
													 + ""+?(Коррсчет <> ""," к\с "+КоррСчет,"")
													 + ""+?(БИК <> ""," БИК "+БИК,"")
													 + ""+?(ЗначениеЗаполнено(Организация.КодПООКПО), " Код ОКПО " + Организация.КодПООКПО + " ", "");
	КонецЕсли;
	
	ОбластьШапка.Параметры.ИнфаОтправитель = ?(ЗначениеЗаполнено(Организация.ИНН), "ИНН " + Организация.ИНН + " ", "")
											+ ?(ЗначениеЗаполнено(Организация.КПП), ",КПП " + Организация.КПП + " ", "")
											+ ?(ЗначениеЗаполнено(Организация.НаименованиеПолное), Организация.НаименованиеПолное + " ", Организация.Наименование + " ")
											+ ?(ЗначениеЗаполнено(АдресОрганизации),АдресОрганизации + " ", "");	
	
	ОбластьШапка.Параметры.Перевозчик = Объект.Перевозчик.НаименованиеПолное;
	
	Если Объект.Маршрут.СкладПолучатель.Renault_СкладХраненияАМ Тогда
		ОбластьШапка.Параметры.Договор = "Договор:";
		ПредставлениеДоговора = Объект.Маршрут.СкладПолучатель.ПредставлениеДляТТН;
		Если ЗначениеЗаполнено(ПредставлениеДоговора) Тогда 
			ОбластьШапка.Параметры.НаименованиеДоговора = ПредставлениеДоговора;
		Иначе
			Сообщить("В складе-получателе не указано представление для ТТН");
		КонецЕсли;
	КонецЕсли;
	
	Водитель = Объект.Водитель;
	Если ЗначениеЗаполнено(Водитель) Тогда
		ОбластьШапка.Параметры.Водитель = ?(ЗначениеЗаполнено(Водитель),Водитель,"");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних";
		Запрос.УстановитьПараметр("ФизЛицо", Водитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбластьШапка.Параметры.НомерПаспорта = "" + Выборка.ДокументСерия + " №" + Выборка.ДокументНомер;
		КонецЕсли;
	КонецЕсли;
	
	ОбластьШапка.Параметры.Дата = Объект.Дата;
	ОбластьШапка.Параметры.ПунктПогрузки = Объект.Маршрут.СкладОтправитель.Renault_Территория.Адрес;
	ОбластьШапка.Параметры.ПунктРазгрузки = Объект.Маршрут.СкладПолучатель.Renault_Территория.Адрес;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Для Каждого Строка Из Объект.Автомобили Цикл
		
		ТекАвто = Строка.Автомобиль;
		ОбластьСтрока.Параметры.НомерПП = НомерПП;
		ОбластьСтрока.Параметры.Наименование = "" + ТекАвто.Модель.Производитель + " " + ТекАвто.Модель;
		ОбластьСтрока.Параметры.ВнутреннийНомер = Строка.Место;
		ОбластьСтрока.Параметры.ВИН = ТекАвто.Код;
		
		НомерПП = НомерПП + 1;
		ТабДок.Вывести(ОбластьСтрока);
	
	КонецЦикла;
	
	ТабДок.Вывести(Запчасти);
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПечатьАктаПриемаПередачи(ДополнительныеПараметры, ДоверенноеЛицо = Неопределено, Шаблон = Неопределено)
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ТекОбъект.ПолучитьМакет("АктПриемаПередачи");
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	Покупатель   = Объект.Маршрут.СкладПолучатель.Организация;
	сОрганизация = ПолучитьСтруктуру(Объект.Организация);
	сПокупатель  = ПолучитьДанныеЮрЛица(Покупатель);
	
	Местоположение = Константы.Месторасположение.Получить();
	
	Муж = Перечисления.ПолФизическихЛиц.Мужской;
	
	Если ДоверенноеЛицо[0].Значение.Пол = Неопределено Тогда
		Сообщить("Данные пола лица для заключения договора не указаны! Не все данные будут заполнены!", СтатусСообщения.Важное);
	Иначе
		Если ДоверенноеЛицо[0].Значение.Пол = Муж Тогда 
			Действие = ", действующего на основании ";
		Иначе
			Действие = ", действующей на основании ";
		КонецЕсли;
	КонецЕсли;
	
	Если ДоверенноеЛицо[1].Значение = Перечисления.Бит_ОтветственныеДляШаблонов.ГенеральныйДиректор Тогда
		Ответственный = "в лице Генерального директора " + ДоверенноеЛицо[0].Значение.ФИОвРодительномПадеже + Действие + "Устава";
	ИначеЕсли ДоверенноеЛицо[1].Значение = Перечисления.Бит_ОтветственныеДляШаблонов.МенеджерКорпоративногоОтдела Тогда
		ДанныеДоверенности = Renault_ОбщегоНазначения.ПолучитьДанныеДоверенности(ДоверенноеЛицо[0].Значение, Объект.ДатаОперации, Объект.Организация);
		Ответственный = "в лице менеджера корпоративного отдела " + ДоверенноеЛицо[0].Значение.ФИОвРодительномПадеже + Действие + "доверенности № " + ДанныеДоверенности.ДоверенностьНомер + " от " + Формат(ДанныеДоверенности.ДоверенностьДата,"ДФ=dd.MM.yyyy") + " г.";
	ИначеЕсли ДоверенноеЛицо[1].Значение = Перечисления.Бит_ОтветственныеДляШаблонов.РуководительКорпоративногоОтдела Тогда
		ДанныеДоверенности = Renault_ОбщегоНазначения.ПолучитьДанныеДоверенности(ДоверенноеЛицо[0].Значение, Объект.ДатаОперации, Объект.Организация);
		Ответственный = "в лице руководителя корпоративного отдела " + ДоверенноеЛицо[0].Значение.ФИОвРодительномПадеже + Действие + "доверенности № " + ДанныеДоверенности.ДоверенностьНомер + " от " + Формат(ДанныеДоверенности.ДоверенностьДата,"ДФ=dd.MM.yyyy") + " г.";
	КонецЕсли;
	
	Если Не Шаблон = Неопределено Тогда
		
		Если Не Шаблон.Должность = Справочники.Бит_ДолжностиДоверенныхЛиц.ГлаваПредставительства Тогда
			ПредставлениеПокупателя = сПокупатель.НаименованиеПолное + ", " + Шаблон.Должность.Представление;
		Иначе
			ПредставлениеПокупателя = "Представительство компании " + сПокупатель.НаименованиеПолное + ", в лице " + Шаблон.Должность.ДолжностьДляПечати;
		КонецЕсли;
		Если Шаблон.НаОсновании.Ссылка = Справочники.Бит_ОснованиеДоверенныхЛиц.Доверенность Тогда
			Если ДополнительныеПараметры.ПолДоверенногоЛица = Муж Тогда
				ПредставлениеДоверенногоЛицаПокупателя 		= "" + ДополнительныеПараметры.ФИОВРодПадеже + ", действующего " + Шаблон.НаОсновании.Представление + " № " + ДополнительныеПараметры.Доверенность.НомерДоверенности + " от " + Формат(ДополнительныеПараметры.Доверенность.ДатаВыдачи, "ДФ=dd.MM.yyyy"); 
			Иначе ПредставлениеДоверенногоЛицаПокупателя 	= "" + ДополнительныеПараметры.ФИОВРодПадеже + ", действующей " + Шаблон.НаОсновании.Представление + " № " + ДополнительныеПараметры.Доверенность.НомерДоверенности + " от " + Формат(ДополнительныеПараметры.Доверенность.ДатаВыдачи, "ДФ=dd.MM.yyyy"); 
			КонецЕсли;
		Иначе
			Если ДополнительныеПараметры.ПолДоверенногоЛица = Муж Тогда
				ПредставлениеДоверенногоЛицаПокупателя 		= ДополнительныеПараметры.ФИОВРодПадеже + ", действующего " + Шаблон.НаОсновании.Представление; 
			Иначе ПредставлениеДоверенногоЛицаПокупателя 	= ДополнительныеПараметры.ФИОВРодПадеже + ", действующей " + Шаблон.НаОсновании.Представление; 
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ПредставлениеПокупателя = сПокупатель.НаименованиеПолное + ", в лице ";
		Если ДополнительныеПараметры.ПолДоверенногоЛица = Муж Тогда
			ПредставлениеДоверенногоЛицаПокупателя 		= "" + ДополнительныеПараметры.ФИОВРодПадеже + ", действующего на основании Доверенности № " + ДополнительныеПараметры.Доверенность.НомерДоверенности + " от " + Формат(ДополнительныеПараметры.Доверенность.ДатаВыдачи, "ДФ=dd.MM.yyyy"); 
		Иначе ПредставлениеДоверенногоЛицаПокупателя 	= "" + ДополнительныеПараметры.ФИОВРодПадеже + ", действующей на основании Доверенности № " + ДополнительныеПараметры.Доверенность.НомерДоверенности + " от " + Формат(ДополнительныеПараметры.Доверенность.ДатаВыдачи, "ДФ=dd.MM.yyyy"); 
		КонецЕсли;
		
	КонецЕсли;
	
	ОтПокупателя  = Renault_ОбщегоНазначения.ФамилияИнициалыФизЛица(ДополнительныеПараметры.ДоверенноеЛицо.Наименование);
	ОтОрганизации = Renault_ОбщегоНазначения.ФамилияИнициалыФизЛица(ДоверенноеЛицо[0].Значение);
	
	ОбластьШапка.Параметры.ОрганизацияНаименованиеПолное  = сОрганизация.НаименованиеПолное;
	ОбластьШапка.Параметры.ОрганизацияЮридическийАдрес    = сОрганизация.АдресОсновной;
	ОбластьШапка.Параметры.ОрганизацияИНН                 = сОрганизация.ИНН;
	ОбластьШапка.Параметры.Местоположение                 = Местоположение;
	ОбластьШапка.Параметры.Дата                           = Формат(Объект.ДатаОперации, "ДФ='«дд» ММММ гггг ""г.""'");
	ОбластьШапка.Параметры.ОрганизацияНаименованиеКраткое = сОрганизация.НаименованиеКраткое;
	ОбластьШапка.Параметры.ОрганизацияДоверенноеЛицо	  = Ответственный;
	ОбластьШапка.Параметры.ПокупательПредставление		  = ПредставлениеПокупателя;
	ОбластьШапка.Параметры.ПокупательДоверенноеЛицо       = ПредставлениеДоверенногоЛицаПокупателя;
	ОбластьШапка.Параметры.ПредставлениеДоговора          = ?(ЗначениеЗаполнено(Объект.Маршрут.СкладПолучатель.ПредставлениеДляАкта), Объект.Маршрут.СкладПолучатель.ПредставлениеДляАкта, "");
	
	ТабДок.Вывести(ОбластьШапка);
	
	//получим закупочную стоимость автомобиля
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабЧастьАвтомобили.Автомобиль
	|ПОМЕСТИТЬ ВТ_ТабЧасть
	|ИЗ
	|	Документ.ПеремещениеАвтомобилей.Автомобили КАК ТабЧастьАвтомобили
	|ГДЕ
	|	ТабЧастьАвтомобили.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьАвтомобиляОстатки.СуммаОстаток КАК Стоимость,
	|	СтоимостьАвтомобиляОстатки.Автомобиль
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	РегистрНакопления.СтоимостьАвтомобиля.Остатки(
	|			&Период,
	|			Автомобиль В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Табл.Автомобиль
	|					ИЗ
	|						ВТ_ТабЧасть КАК Табл)
	|				И ВидЦены = ЗНАЧЕНИЕ(Перечисление.ВидыЦен.Закупочная)) КАК СтоимостьАвтомобиляОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабЧасть.Автомобиль,
	|	ЕСТЬNULL(ВТ_Стоимость.Стоимость, 0) КАК Стоимость
	|ИЗ
	|	ВТ_ТабЧасть КАК ВТ_ТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Стоимость КАК ВТ_Стоимость
	|		ПО ВТ_ТабЧасть.Автомобиль = ВТ_Стоимость.Автомобиль";
	
	Запрос.УстановитьПараметр("Период", Объект.ДатаОперации);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из Объект.Автомобили Цикл
		
		ТекАвто = Строка.Автомобиль;
		ОбластьСтрока.Параметры.Модель = ТекАвто.Модель.Наименование;
		ОбластьСтрока.Параметры.Версия = ТекАвто.Версия.Наименование + ", " + ТекАвто.Версия.Код;
		ОбластьСтрока.Параметры.Цвет   = ТекАвто.ЦветКузова.Наименование;
		ОбластьСтрока.Параметры.VIN    = ТекАвто.Код; 
		СтоимостьАвто = ТаблицаЦен.НайтиСтроки(Новый Структура("Автомобиль",ТекАвто))[0].Стоимость; 
		ОбластьСтрока.Параметры.Цена   = "" + ?(СтоимостьАвто <> 0, СтоимостьАвто, "0")  + " руб."; 
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ПокупательРеквизиты = 
						"" + сПокупатель.АдресОсновной + "
						|Тел: " + сПокупатель.ТелефонОсновной + "
						|ИНН: " + сПокупатель.ИНН + " КПП: " + сПокупатель.КПП + "
						|ОГРН: " + сПокупатель.ОГРН + "
						|р/с " + сПокупатель.НомерСчета + " в
						|" + сПокупатель.БанкНаименование + "
						|к/с " + сПокупатель.БанкКоррСчет + ", БИК " + сПокупатель.БанкБИК + "
						|ОКВЭД: " + сПокупатель.ОКВЭД + " ОКПО: " + сПокупатель.ОКПО;
	
	ОрганизацияРеквизиты = 
						"" + сОрганизация.АдресОсновной + "
						|Тел: " + сОрганизация.ТелефонОсновной + "
						|ИНН: " + сОрганизация.ИНН + " КПП: " + сОрганизация.КПП + "
						|ОГРН: " + сОрганизация.ОГРН + "
						|р/с " + сОрганизация.НомерСчета + " в
						|" + сОрганизация.БанкНаименование + "
						|к/с " + сОрганизация.БанкКоррСчет + ", БИК " + сОрганизация.БанкБИК + "
						|ОКВЭД: " + сОрганизация.ОКВЭД + " ОКПО: " + сОрганизация.ОКПО;
	
	ОбластьПодвал.Параметры.Организация			 	  = сОрганизация.НаименованиеКраткое;
	ОбластьПодвал.Параметры.Покупатель           	  = сПокупатель.НаименованиеПолное;
	ОбластьПодвал.Параметры.ПокупательРеквизиты  	  = ПокупательРеквизиты;
	ОбластьПодвал.Параметры.ОрганизацияРеквизиты 	  = ОрганизацияРеквизиты;
	ОбластьПодвал.Параметры.ОрганизацияДоверенноеЛицо = ОтОрганизации;
	ОбластьПодвал.Параметры.ПокупательДоверенноеЛицо  = ОтПокупателя;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьСтруктуру(Контрагент)
	
	Возврат ?(Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо, Renault_ОбщегоНазначения.ПолучитьДанныеФизЛица(Контрагент), Renault_ОбщегоНазначения.ПолучитьДанныеЮрЛица(Контрагент));
	
КонецФункции

&НаКлиенте
Процедура АвтомобильНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Результат = ПолучитьЭвакуаторы();
	Элемент.СписокВыбора.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Автомобиль"));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЭвакуаторы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_СобственныеАвтомобили.Автомобиль
	|ИЗ
	|	РегистрСведений.Renault_СобственныеАвтомобили КАК Renault_СобственныеАвтомобили";
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВодительНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Результат = ПолучитьВодителей();
	Элемент.СписокВыбора.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Водитель"));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВодителей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_СобственныеАвтомобили.Водитель
	|ИЗ
	|	РегистрСведений.Renault_СобственныеАвтомобили КАК Renault_СобственныеАвтомобили
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_СобственныеАвтомобили.Автомобиль = &Автомобиль
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Автомобиль", Объект.Автомобиль);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьПеревозчика()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Renault_СобственныеАвтомобили.Перевозчик КАК Перевозчик
	|ИЗ
	|	РегистрСведений.Renault_СобственныеАвтомобили КАК Renault_СобственныеАвтомобили
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Renault_СобственныеАвтомобили.Автомобиль = &Автомобиль
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Автомобиль", Объект.Автомобиль);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПеревозчикНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Результат = ПолучитьПеревозчика();
	Элемент.СписокВыбора.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Перевозчик"));
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутПриИзменении(Элемент)
	
	УстановитьДоступностьРеквизитов();
	УстановитьВидимостьМест();
	
	Если Объект.Маршрут.СкладОтправитель.Renault_Территория = Объект.Маршрут.СкладПолучатель.Renault_Территория Тогда
		Элементы.Статус.Доступность = Ложь;
	Иначе
		Элементы.Статус.Доступность = Истина;
	КонецЕсли;
	
	Объект.Автомобили.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРеквизитов()
	
	Если Не Объект.Маршрут.Пустая() Тогда
		
		Если Объект.Маршрут.СкладОтправитель.Renault_Территория = Объект.Маршрут.СкладПолучатель.Renault_Территория Тогда
			
			Элементы.НашАвтомобиль.Доступность = Ложь;
			Элементы.НашВодитель.Доступность = Ложь;
			Элементы.ОбратныйРейс.Доступность = Ложь;
			Элементы.Водитель.Доступность = Ложь;
			Элементы.Автомобиль.Доступность = Ложь;
			
		Иначе
			
			Элементы.НашАвтомобиль.Доступность = Истина;
			Элементы.НашВодитель.Доступность = Истина;
			Элементы.ОбратныйРейс.Доступность = Истина;
			Элементы.Водитель.Доступность = Истина;
			Элементы.Автомобиль.Доступность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДоступновстьВсехРеквизитов()
	
	Если Объект.Проведен Тогда
		Элементы.АвтомобилиАвтомобиль.ТолькоПросмотр = Истина;
		Элементы.Водитель.ТолькоПросмотр = Истина;
		Элементы.Автомобиль.ТолькоПросмотр = Истина;
		Элементы.НашАвтомобиль.ТолькоПросмотр = Истина;
		Элементы.НашВодитель.ТолькоПросмотр = Истина;
		Элементы.Перевозчик.ТолькоПросмотр = Истина;
		Элементы.ОбратныйРейс.ТолькоПросмотр = Истина;
		Элементы.Маршрут.ТолькоПросмотр = Истина;
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Дата.ТолькоПросмотр = Истина;
		Элементы.Номер.ТолькоПросмотр = Истина;
		Элементы.ЗафиксироватьОперацию.ТолькоПросмотр = Истина;
		Элементы.ДатаОперации.ТолькоПросмотр = Истина;
		Элементы.АвтомобилиДобавитьАвто.Доступность = Ложь;
		Элементы.АвтомобилиИзменитьАвто.Доступность = Ложь;
		Элементы.АвтомобилиУдалитьАвто.Доступность = Ложь;
		Элементы.АвтомобилиЗаполнитьПоПлану.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступновстьВсехРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобилиАвтомобильПриИзменении(Элемент)
	
	Элемент = ПолучитьПарковочноеМесто(Элемент.Значение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПарковочноеМесто(Автомобиль);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Renault_МестаАвтомобилей.ПарковочноеМесто
	|ИЗ
	|	РегистрСведений.Renault_МестаАвтомобилей КАК Renault_МестаАвтомобилей
	|ГДЕ
	|	Renault_МестаАвтомобилей.Автомобиль = &Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПарковочноеМесто;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не Объект.Проведен Тогда
		Сообщить("Для изменения статуса необходимо провести документ!");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	//Исправить
	Если ИСТИНА Тогда//РольДоступна("бит_ПродавецСалона") Или РольДоступна("бит_МенеджерСалона") Тогда
		ДоступнаяТерритория = ПараметрыСеанса.Renault_ПраваПользователя.Территория;
		Если Объект.Маршрут.СкладПолучатель.Renault_Территория <> ДоступнаяТерритория Тогда
			Сообщить("Закрывать перемещение автомобилей разрешено только для маршрутов, у которых склад-получатель находится на территории " + ДоступнаяТерритория);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//Исправить
	Если ИСТИНА Тогда//РольДоступна("бит_ПродавецСалона") Или РольДоступна("бит_МенеджерСалона") Тогда
		ДоступнаяТерритория = ПараметрыСеанса.Renault_ПраваПользователя.Территория;
		Если (ВыбранноеЗначение.СкладОтправитель.Renault_Территория <> ДоступнаяТерритория) Или (ВыбранноеЗначение.СкладПолучатель.Renault_Территория <> ДоступнаяТерритория) Тогда
			Сообщить("Доступны маршруты только внутри территории " + ДоступнаяТерритория);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобилиЗаявкаНаПеремещениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если ЗаявкиСписок <> Неопределено Тогда
		Элемент.СписокВыбора.ЗагрузитьЗначения(ЗаявкиСписок); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьАктаПриемаПередачи(Команда)
	
	Если Не Объект.Проведен Тогда
		Сообщить("Для печати Акта приема-передачи необходимо провести документ!");
		Возврат;
	КонецЕсли;
	
	ДокЛицо = ПолучитьДоверенноеЛицоОрганизации(Объект.Организация); 
	
	Если ДокЛицо = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Док = Неопределено;
	
	ПередатьВладельца = Новый Структура;
	ЗакрыватьПриВыборе = Истина;
	
	ПараметрыОтбора = Новый Структура;
	
	ПередатьВладельца.Вставить("Контрагент", Объект.Маршрут.СкладПолучатель.Организация);
		
	ПередатьВладельца.Вставить("ЗакрыватьПриВыборе", Истина);
	ПередатьВладельца.Вставить("Отбор", ПараметрыОтбора);
	
	Док = ОткрытьФормуМодально("РегистрСведений.пацДоверенныеЛицаКонтрагентов.Форма.ФормаСпискаДляВыбора", ПередатьВладельца, ЭтаФорма);
	Если Док = Неопределено Тогда Возврат; КонецЕсли;
	
	ПредПокупатель = ВыяснитьНужныйШаблон(Док);
	
	Если Не ПредПокупатель = Истина Тогда	
		ПредПокупателя = ПредПокупатель.ШаблоныДляПечати.Ссылка;
	Иначе
		ПредПокупателя = Неопределено
	КонецЕсли;
	
	ТабДок = ПечатьАктаПриемаПередачи(Док, ДокЛицо, ПредПокупателя);
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДоверенноеЛицоОрганизации(Орг)
	
	Место = Константы.Месторасположение.Получить();
	
	Запрос = Новый Запрос;
	
	Если Место = Перечисления.МестаРасположения.Москва Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бит_ОтветственныеДляШаблонов.ФизическоеЛицо,
		|	Бит_ОтветственныеДляШаблонов.ОтветственноеЛицо КАК Должность
		|ИЗ
		|	РегистрСведений.Бит_ОтветственныеДляШаблонов КАК Бит_ОтветственныеДляШаблонов
		|ГДЕ
		|	НЕ Бит_ОтветственныеДляШаблонов.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.Бит_ОтветственныеДляШаблонов.РуководительКорпоративногоОтдела)
		|	И Бит_ОтветственныеДляШаблонов.СтруктурнаяЕдиница = &Организация";
		
	Иначе 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бит_ОтветственныеДляШаблонов.ФизическоеЛицо,
		|	Бит_ОтветственныеДляШаблонов.ОтветственноеЛицо КАК Должность
		|ИЗ
		|	РегистрСведений.Бит_ОтветственныеДляШаблонов КАК Бит_ОтветственныеДляШаблонов
		|ГДЕ
		|	Бит_ОтветственныеДляШаблонов.СтруктурнаяЕдиница = &Организация";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Орг);
	Список = Запрос.Выполнить().Выгрузить();
	
	ВыбранноеДоверенноеЛицо = Список.ВыбратьСтроку("Выберите доверенное лицо от вашей организации:");
	
	Если ВыбранноеДоверенноеЛицо = Неопределено Тогда
		
		Сообщить("Не выбрали доверенное лицо от организации");
		
	Иначе Лицо = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Вид = &Вид
		|	И КонтактнаяИнформация.Объект = &Объект";
		Запрос.УстановитьПараметр("Объект",ВыбранноеДоверенноеЛицо.ФизическоеЛицо);
		Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.Доверенность);
		Доверка = Запрос.Выполнить().Выгрузить();
		
		Лицо.Добавить(ВыбранноеДоверенноеЛицо.ФизическоеЛицо);
		Лицо.Добавить(ВыбранноеДоверенноеЛицо.Должность);
		
		Если Не Доверка.Количество() = 0 Тогда
			Лицо.Добавить(Доверка[0].Поле2, "Номер");
			Лицо.Добавить(Доверка[0].Поле3, "Дата");
		Иначе Лицо.Добавить(0000000000000000000000000000000, "Номер");
			Лицо.Добавить(ТекущаяДата(), "Дата");
		КонецЕсли;
		
		Возврат Лицо;
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Функция ВыяснитьНужныйШаблон(Шаблоны)

	ЗначенияДляЗаполненияИзШаблонов = Новый ТаблицаЗначений;
	ЗначенияДляЗаполненияИзШаблонов.Колонки.Добавить("ШаблоныДляПечати");
	
	Для Каждого Строки из Шаблоны.ДоступныеШаблоны.ДоступныеШаблоны Цикл
		СтрокаТаблицы = ЗначенияДляЗаполненияИзШаблонов.Добавить(); 
		СтрокаТаблицы.ШаблоныДляПечати = Строки.ДоступныйШаблон.Ссылка;
	КонецЦикла;
	
	Если Не ЗначенияДляЗаполненияИзШаблонов.Количество() = 0 Тогда
		ПредПокупателя = ЗначенияДляЗаполненияИзШаблонов.ВыбратьСтроку("В какой должности находится доверенное лицо покупателя:");
		Возврат ПредПокупателя;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеЮрЛица(Контрагент)
	
	Результат = Новый Структура;
	
	Результат.Вставить("НаименованиеПолное"     , "");
	Результат.Вставить("НаименованиеКраткое"    , "");
	Результат.Вставить("ИНН"                    , "");
	Результат.Вставить("КПП"                    , "");
	Результат.Вставить("ОКВЭД"                  , "");
	Результат.Вставить("ОКПО"                   , "");
	Результат.Вставить("ОГРН"                   , "");
	Результат.Вставить("АдресОсновной"          , "");
	Результат.Вставить("ТелефонОсновной"        , "");
	Результат.Вставить("НомерСчета"             , "");
	Результат.Вставить("БанкНаименование"       , "");
	Результат.Вставить("БанкБИК"                , "");
	Результат.Вставить("БанкКоррСчет"           , "");
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Исправить
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк КАК БанкНаименование,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.Код КАК БанкБИК,
	|	Контрагенты.ОсновнойБанковскийСчет.Банк.КоррСчет КАК БанкКоррСчет,
	|	Контрагенты.КодПоОКПО КАК ОКПО,
	|	Контрагенты.Наименование КАК НаименованиеКраткое,
	|	Контрагенты.Ссылка,
	|	Контрагенты.ОГРН,
	|	Контрагенты.ОКВЭД
	|ПОМЕСТИТЬ ВТОсновныеДанные
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление КАК Адрес
	|ПОМЕСТИТЬ ВТАдрес
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Вид = &ВидАдрес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Представление КАК Телефон
	|ПОМЕСТИТЬ ВТТелефон
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Контрагент
	|	И КонтактнаяИнформация.Вид = &ВидТелефон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОсновныеДанные.НаименованиеПолное,
	|	ВТОсновныеДанные.ИНН,
	|	ВТОсновныеДанные.КПП,
	|	ВТОсновныеДанные.НомерСчета,
	|	ВТОсновныеДанные.БанкНаименование,
	|	ВТОсновныеДанные.БанкБИК,
	|	ВТОсновныеДанные.БанкКоррСчет,
	|	ВТОсновныеДанные.ОКПО,
	|	ВТОсновныеДанные.ОГРН,
	|	ВТОсновныеДанные.ОКВЭД,
	|	ВТОсновныеДанные.НаименованиеКраткое,
	|	ЕСТЬNULL(ВТТелефон.Телефон, """") КАК ТелефонОсновной,
	|	ЕСТЬNULL(ВТАдрес.Адрес, 0) КАК АдресОсновной
	|ИЗ
	|	ВТОсновныеДанные КАК ВТОсновныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАдрес КАК ВТАдрес
	|		ПО ВТОсновныеДанные.Ссылка = ВТАдрес.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТелефон КАК ВТТелефон
	|		ПО ВТОсновныеДанные.Ссылка = ВТТелефон.Объект";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидАдрес", Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

//------------------END-------------------
//самописные процедуры и функции
//////////////////////////////////////////
